# взято с валидации на сервере
# обязательна @, после нее > одного символа
# потом обязательна точка, после нее >= двух символов
EMAIL_PATTERN = r'(^[^@]+@[^@]+.[^@]{2,}$)'

# +79xxxxxxxxx, 79xxxxxxxxx, 89xxxxxxxxx, 9xxxxxxxxx
# код оператора можено в '(xxx)'
# между xxx-xx-xx могут быть '-'
PHONE_PATTERN = r'^(\+7|7|8)??\(?[9][0-9]{2}\)?[0-9]{3}[\s\-]?[0-9]{2}[\s\-]?[0-9]{2}$'

# xxx-xxx, x - цифра
AUTHORITY_CODE_PATTERN = r'^[0-9]{3}-[0-9]{3}$'

# 6 цифр подряд
POSTAL_CODE_PATTERN = r'^[0-9]{6}$'

# 4 цифры подряд
RU_SERIAL_PASSPORT_PATTERN = r'^[0-9]{4}$'

# 6 цифр подряд
RU_NUMBER_PASSPORT_PATTERN = r'^[0-9]{6}$'

# xxx-xxx-xxxxx, любой '-' необязателен, x - цифра
SNILS_PATTERN = r'^[0-9]{3}-?[0-9]{3}-?[0-9]{3}[0-9]{2}$'

# 12 цифр подряд
INN_PATTERN = r'^[0-9]{12}$'

# 'код региона': 'название региона'
REGION_CODES = {
    "01": "Республика Адыгея",
    "02": "Республика Башкортостан",
    "03": "Республика Бурятия",
    "04": "Республика Алтай",
    "05": "Республика Дагестан",
    "06": "Республика Ингушетия",
    "07": "Кабардино-Балкарская Республика",
    "08": "Республика Калмыкия",
    "09": "Карачаево-Черкесская Республика",
    "10": "Республика Карелия",
    "11": "Республика Коми",
    "12": "Республика Марий Эл",
    "13": "Республика Мордовия",
    "14": "Республика Саха (Якутия)",
    "15": "Республика Северная Осетия — Алания",
    "16": "Республика Татарстан",
    "17": "Республика Тыва",
    "18": "Удмуртская Республика",
    "19": "Республика Хакасия",
    "20": "Чеченская республика",
    "21": "Чувашская Республика",
    "22": "Алтайский край",
    "23": "Краснодарский край",
    "24": "Красноярский край",
    "25": "Приморский край",
    "26": "Ставропольский край",
    "27": "Хабаровский край",
    "28": "Амурская область",
    "29": "Архангельская область",
    "30": "Астраханская область",
    "31": "Белгородская область",
    "32": "Брянская область",
    "33": "Владимирская область",
    "34": "Волгоградская область",
    "35": "Вологодская область",
    "36": "Воронежская область",
    "37": "Ивановская область",
    "38": "Иркутская область",
    "39": "Калининградская область",
    "40": "Калужская область",
    "41": "Камчатский край",
    "42": "Кемеровская область",
    "43": "Кировская область",
    "44": "Костромская область",
    "45": "Курганская область",
    "46": "Курская область",
    "47": "Ленинградская область",
    "48": "Липецкая область",
    "49": "Магаданская область",
    "50": "Московская область",
    "51": "Мурманская область",
    "52": "Нижегородская область",
    "53": "Новгородская область",
    "54": "Новосибирская область",
    "55": "Омская область",
    "56": "Оренбургская область",
    "57": "Орловская область",
    "58": "Пензенская область",
    "59": "Пермский край",
    "60": "Псковская область",
    "61": "Ростовская область",
    "62": "Рязанская область",
    "63": "Самарская область",
    "64": "Саратовская область",
    "65": "Сахалинская область",
    "66": "Свердловская область",
    "67": "Смоленская область",
    "68": "Тамбовская область",
    "69": "Тверская область",
    "70": "Томская область",
    "71": "Тульская область",
    "72": "Тюменская область",
    "73": "Ульяновская область",
    "74": "Челябинская область",
    "75": "Забайкальский край",
    "76": "Ярославская область",
    "77": "Москва",
    "78": "Санкт-Петербург",
    "79": "Еврейская автономная область",
    # "80": "Забайкальский край",
    # "81": "Пермский край",
    "83": "Ненецкий автономный округ",
    # "84": "Красноярский край",
    # "85": "Иркутская область",
    "86": "Ханты-Мансийский автономный округ - Югра",
    "87": "Чукотский автономный округ",
    # "88": "Красноярский край",
    "89": "Ямало-Ненецкий автономный округ",
    # "90": "Московская область",
    "91": "Республика Крым",
    "92": "Севастополь",
    "99": "Иные территории, включая город и космодром Байконур"
    # "93": "Краснодарский край",
    # "95": "Чеченская республика",
    # "96": "Свердловская область",
    # "97": "Москва",
    # "98": "Санкт-Петербург",
    # "99": "Москва"
}
